In [15]:
import numpy as np

import pandas as pd

In [16]:
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [21]:
df = pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [22]:
df

             A         B
G1 1  0.867100 -1.172884
   2  1.145492  0.466392
   3 -0.018861 -0.517280
G2 1 -0.579153 -1.230992
   2 -1.063596  1.441588
   3  0.432473 -1.110954

In [26]:
df.index.names = ['Groups','Num']

In [27]:
df

                   A         B
Groups Num
G1     1    0.867100 -1.172884
       2    1.145492  0.466392
       3   -0.018861 -0.517280
G2     1   -0.579153 -1.230992
       2   -1.063596  1.441588
       3    0.432473 -1.110954

In [28]:
df.loc['G2'].loc[2].loc['B']

1.4415879626108272

In [29]:
df.loc['G1']

            A         B
Num
1    0.867100 -1.172884
2    1.145492  0.466392
3   -0.018861 -0.517280

In [30]:
df.xs('G1')

            A         B
Num
1    0.867100 -1.172884
2    1.145492  0.466392
3   -0.018861 -0.517280

In [31]:
df.xs(1,level='Num')

               A         B
Groups
G1      0.867100 -1.172884
G2     -0.579153 -1.230992

In [32]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [33]:
df = pd.DataFrame(d)

In [34]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [35]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [36]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [37]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [38]:
df.fillna(value='Fill Val')

          A         B  C
0         1         5  1
1         2  Fill Val  2
2  Fill Val  Fill Val  3

In [40]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64